{
  "id": "appsec-tools",
  "title": "Введение в DAST, SAST, SCA, IAST и RASP: Гид по инструментам безопасности",
  "slug": "appsec-tools",
  "description": "Разбор основных методологий тестирования безопасности приложений (AppSec) с примерами бесплатных инструментов для интеграции в SDLC.",
  "type": "docs",
  "typename": "Документация",
  "author": "veilosophy",
  "date": "2026-01-24",
  "tags": [
    "AppSec",
    "DAST",
    "SAST",
    "SCA",
    "IAST",
    "RASP",
    "OpenSource"
  ],
  "keywords": "безопасность приложений, сканирование уязвимостей, DevSecOps, бесплатные инструменты ИБ",
  "canonical": "null",
  "robots": "index, follow",
  "lang": "ru",
  "content": "<h2>Введение</h2>\n<p>Безопасность приложений — это не опция, а необходимость в современной разработке. С ростом числа кибератак и утечек данных разработчики и команды безопасности нуждаются в надежных инструментах для выявления уязвимостей на всех этапах жизненного цикла разработки программного обеспечения (SDLC). </p>\n<p>В этой статье мы рассмотрим основные категории инструментов безопасности приложений: <strong>DAST</strong> (Dynamic Application Security Testing), <strong>SAST</strong> (Static Application Security Testing), <strong>SCA</strong> (Software Composition Analysis) и <strong>IAST/RASP</strong> (Interactive/Runtime Application Security Protection). Мы разберем их назначение, преимущества и недостатки, а также предоставим список бесплатных инструментов, которые можно интегрировать в вашу инфраструктуру разработки.</p>\n<hr>\n<h2>Терминология</h2>\n<h3>SAST (Static Application Security Testing)</h3>\n<p><strong>SAST</strong> — это статический анализ исходного кода приложения без его выполнения. Инструменты SAST сканируют код на этапе разработки, выявляя потенциальные уязвимости, такие как SQL-инъекции, XSS, небезопасные функции и другие проблемы безопасности.</p>\n<blockquote>\n<p><strong>Зачем нужен SAST?</strong> Раннее выявление уязвимостей в коде позволяет устранить их до развертывания приложения, что значительно снижает стоимость исправления и риски для безопасности.</p>\n</blockquote>\n<h3>DAST (Dynamic Application Security Testing)</h3>\n<p><strong>DAST</strong> — это динамический анализ работающего приложения. В отличие от SAST, DAST тестирует приложение извне, имитируя атаки злоумышленников на развернутое приложение. Инструменты DAST не требуют доступа к исходному коду.</p>\n<blockquote>\n<p><strong>Зачем нужен DAST?</strong> DAST выявляет уязвимости времени выполнения, проблемы конфигурации и ошибки, которые проявляются только в работающем приложении, включая проблемы аутентификации, управления сеансами и обработки данных.</p>\n</blockquote>\n<h3>SCA (Software Composition Analysis)</h3>\n<p><strong>SCA</strong> — это анализ сторонних компонентов и зависимостей, используемых в приложении. Современные приложения часто содержат десятки или сотни библиотек с открытым исходным кодом, каждая из которых может содержать известные уязвимости.</p>\n<blockquote>\n<p><strong>Зачем нужен SCA?</strong> SCA помогает отслеживать известные уязвимости в зависимостях (CVE), проверяет лицензии и обеспечивает безопасность цепочки поставок программного обеспечения.</p>\n</blockquote>\n<h3>IAST (Interactive Application Security Testing)</h3>\n<p><strong>IAST</strong> — это гибридный подход, сочетающий элементы SAST и DAST. IAST-агенты встраиваются в приложение и анализируют его поведение во время выполнения, отслеживая потоки данных и выявляя уязвимости в реальном времени.</p>\n<blockquote>\n<p><strong>Зачем нужен IAST?</strong> IAST обеспечивает более точное обнаружение уязвимостей с меньшим количеством ложных срабатываний, анализируя приложение изнутри во время его работы.</p>\n</blockquote>\n<h3>RASP (Runtime Application Self-Protection)</h3>\n<p><strong>RASP</strong> — это технология защиты приложения во время выполнения. RASP-агенты встраиваются в приложение и могут не только обнаруживать, но и блокировать атаки в реальном времени.</p>\n<blockquote>\n<p><strong>Зачем нужен RASP?</strong> RASP обеспечивает активную защиту работающего приложения, блокируя эксплойты и атаки без необходимости изменения кода или конфигурации.</p>\n</blockquote>\n<hr>\n<h2>Плюсы и минусы инструментов безопасности</h2>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Тип инструмента</th>\n<th align=\"left\">Плюсы</th>\n<th align=\"left\">Минусы</th>\n</tr>\n</thead>\n<tbody><tr>\n<td align=\"left\"><strong>SAST</strong></td>\n<td align=\"left\">Раннее обнаружение; точное указание строк кода; не требует запуска приложения.</td>\n<td align=\"left\">Высокий уровень ложных срабатываний; не видит проблем конфигурации среды.</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>DAST</strong></td>\n<td align=\"left\">Находит реальные уязвимости в рантайме; не нужен доступ к коду; видит ошибки конфигурации.</td>\n<td align=\"left\">Позднее обнаружение в SDLC; сложность автоматизации (нужен стенд); не указывает строку кода.</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>SCA</strong></td>\n<td align=\"left\">Быстрое нахождение известных CVE; проверка лицензий; легкая интеграция в CI/CD.</td>\n<td align=\"left\">Только известные уязвимости; много шума от транзитивных зависимостей.</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>IAST / RASP</strong></td>\n<td align=\"left\">Высокая точность; контекст выполнения; RASP активно блокирует атаки.</td>\n<td align=\"left\">Влияние на производительность; сложность внедрения; мало бесплатных решений.</td>\n</tr>\n</tbody></table>\n<hr>\n<h2>DAST: примеры инструментов</h2>\n<h3>Облачные решения</h3>\n<h4>HostedScan</h4>\n<ul>\n<li><strong>Описание:</strong> Облачная платформа для сканирования веб-приложений и инфраструктуры.</li>\n<li><strong>Бесплатный план:</strong> &quot;Free Forever&quot; план включает до 3-10 сканирований в месяц (ZAP, Nmap, OpenVAS).</li>\n<li><strong>URL:</strong> <a href=\"https://hostedscan.com/\">https://hostedscan.com/</a></li>\n<li><strong>Особенности:</strong> Сканирование OWASP Top 10, SSL/TLS проверки, отчеты на почту.</li>\n<li><strong>Мнение:</strong> Очень отличный сканер если &quot;лень&quot; ставить owasp zap и nmap(но не исключаем что мы можем лишиться часть функций), и выдача отчетов на почту очень хорошее.</li>\n</ul>\n<h3>Локальные / Open Source решения</h3>\n<h4>OWASP ZAP (Zed Attack Proxy)</h4>\n<ul>\n<li><strong>Описание:</strong> Самый популярный в мире бесплатный DAST-инструмент.</li>\n<li><strong>Лицензия:</strong> Apache 2.0.</li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/zaproxy/zaproxy\">https://github.com/zaproxy/zaproxy</a></li>\n<li><strong>Особенности:</strong> Автоматическое сканирование, мощный API для CI/CD, поддержка Docker.</li>\n</ul>\n<h4>Nuclei</h4>\n<ul>\n<li><strong>Описание:</strong> Быстрый сканер на основе YAML-шаблонов от ProjectDiscovery.</li>\n<li><strong>Лицензия:</strong> MIT.</li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/projectdiscovery/nuclei\">https://github.com/projectdiscovery/nuclei</a></li>\n<li><strong>Особенности:</strong> Огромное комьюнити, готовые шаблоны под актуальные CVE.</li>\n</ul>\n<hr>\n<h2>SAST: примеры инструментов</h2>\n<h3>Облачные решения</h3>\n<h4>SonarCloud</h4>\n<ul>\n<li><strong>Описание:</strong> Облачный сервис от создателей SonarQube.</li>\n<li><strong>Бесплатный план:</strong> Бесплатно для публичных репозиториев. Для приватных — бесплатно до 50,000 строк кода (LoC).</li>\n<li><strong>URL:</strong> <a href=\"https://sonarcloud.io/\">https://sonarcloud.io/</a></li>\n<li><strong>Мнение:</strong> Отличный вариант для публичных репозиториев, выводит много информации о потенциальных проблемах + большая библиотека правил. Не самый лучший для приватных тк мало в бесплатном тарифе для приват репозиториев возможностей + присутствует локальная версия и часто видел в вакансиях именно этот продукт на позициях AppSec / DevSecOps.</li>\n</ul>\n<h4>Semgrep Cloud</h4>\n<ul>\n<li><strong>Описание:</strong> Облачная панель управления для Semgrep.</li>\n<li><strong>Бесплатный план:</strong> Бесплатно для команд до 10 человек (Team tier) с поддержкой приватных репозиториев.</li>\n<li><strong>URL:</strong> <a href=\"https://semgrep.dev/\">https://semgrep.dev/</a></li>\n<li><strong>Мнение:</strong> +/- находит правильно но по сравнению с SonarCloud мало вывода информации. Безлимит для приватных/публичных репо гитхаб</li>\n</ul>\n<h4>CodeQL Github</h4>\n<ul>\n<li><strong>Описание:</strong> движок анализа кода, разработанный GitHub для автоматизации проверок безопасности GitHub. Основная особенность CodeQL в том, что он представляет код как данные, создавая базу данных CodeQL для представления кодовой базы, а затем запускает запросы CodeQL к этой базе данных для выявления проблем</li>\n<li><strong>Бесплатный план:</strong> для публичных репозиториев гитхаб</li>\n<li><strong>Где использовать:</strong> GitHub Code Scanning (публичный репозиторий / security / Code scanning ЛИБО Settings / Security / Code scanning)</li>\n</ul>\n<h3>Локальные / Open Source решения</h3>\n<h4>SonarQube Community Edition</h4>\n<ul>\n<li><strong>Описание:</strong> Self-hosted платформа для анализа кода.</li>\n<li><strong>Лицензия:</strong> LGPL v3.</li>\n<li><strong>Установка:</strong> Docker-образ <code>sonarqube:community</code>. или на сайте sonarsource(<a href=\"https://www.sonarsource.com/open-source-editions/sonarqube-community-edition/\">https://www.sonarsource.com/open-source-editions/sonarqube-community-edition/</a>)</li>\n<li><strong>Особенности:</strong> Полный контроль над данными, поддержка 15+ языков в бесплатной версии.</li>\n</ul>\n<h4>Semgrep OSS</h4>\n<ul>\n<li><strong>Описание:</strong> CLI-инструмент для локального сканирования.</li>\n<li><strong>Лицензия:</strong> LGPL 2.1.</li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/semgrep/semgrep\">https://github.com/semgrep/semgrep</a></li>\n</ul>\n<hr>\n<h2>SCA: примеры инструментов</h2>\n<h3>Облачные решения</h3>\n<h4>Snyk</h4>\n<ul>\n<li><strong>Описание:</strong> Лидер рынка анализа зависимостей.</li>\n<li><strong>Бесплатный план:</strong> Ограниченное количество сканирований в месяц для приватных проектов, безлимит для Open Source.</li>\n<li><strong>URL:</strong> <a href=\"https://snyk.io/\">https://snyk.io/</a></li>\n<li><strong>Мнение:</strong> помимо анализа пакетов есть еще и анализ кода и удобные советы по исправлению (Remediation).</li>\n</ul>\n<h4>GitHub Dependabot</h4>\n<ul>\n<li><strong>Описание:</strong> Встроенный инструмент GitHub.</li>\n<li><strong>Бесплатный план:</strong> Полностью бесплатно для всех репозиториев на GitHub.</li>\n<li><strong>Особенности:</strong> Автоматически создает Pull Requests для обновления уязвимых библиотек.</li>\n</ul>\n<h3>Локальные / Open Source решения</h3>\n<h4>Trivy</h4>\n<ul>\n<li><strong>Описание:</strong> Универсальный сканер от Aqua Security.</li>\n<li><strong>Лицензия:</strong> Apache 2.0.</li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/aquasecurity/trivy\">https://github.com/aquasecurity/trivy</a></li>\n<li><strong>Особенности:</strong> Сканирует не только зависимости, но и образы контейнеров, конфигурации Kubernetes и IaC (Terraform).</li>\n</ul>\n<h4>OSV-Scanner</h4>\n<ul>\n<li><strong>Описание:</strong> Сканер от Google, использующий базу OSV.dev.</li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/google/osv-scanner\">https://github.com/google/osv-scanner</a></li>\n</ul>\n<hr>\n<h2>IAST / RASP: бесплатные примеры</h2>\n<p>К сожалению, действительно бесплатных облачных IAST/RASP-решений практически не существует. Эта категория инструментов является преимущественно коммерческой из-за сложности технологии и необходимости поддержки множества языков и фреймворков. (Будет дополнено если найду инструменты под это)</p>\n<hr>\n<h2>Заключение</h2>\n<p>Безопасность приложений требует многоуровневого подхода. Комбинация SAST, DAST и SCA закрывает до 90% типичных рисков. Начните с автоматизации простых проверок и постепенно внедряйте более глубокий анализ.</p>\n"
}