{
  "id": "career-tutorial",
  "title": "Как начать путь в кибербезопасности: от первых шагов до осознанной карьеры",
  "slug": "career-tutorial",
  "description": "Практическое руководство по входу в кибербезопасность - от выбора специализации до первой работы. Реальные методы, без мифов и волшебных курсов.",
  "type": "blog",
  "category": "Карьера",
  "bannercolor": "#2c5282",
  "bannertext": "Карьера в ИБ",
  "author": "veilosophy",
  "date": "2025-12-31",
  "tags": [
    "кибербезопасность",
    "карьера",
    "обучение",
    "джуниор",
    "пентест",
    "DevSecOps",
    "AppSec",
    "Red Team",
    "практика",
    "CTF"
  ],
  "keywords": "карьера в кибербезопасности, как начать в инфобезе, обучение кибербезопасности, джуниор в ИБ, пентестер, DevSecOps, AppSec, Red Team, вход в IT-безопасность, с чего начать в кибербезопасности",
  "canonical": "null",
  "robots": "index, follow",
  "lang": "ru",
  "content": "\nВообще, методы в статье подходят и для любого IT-направления, но давайте сделаем акцент на безопасности. \nВ последнее время всё чаще вижу одни и те же вопросы:\n«С чего начать в кибербезопасности?» или «Всем привет, хочу работать в инфобезе в Red Team, посоветуйте книжки, курсы и т. д., чтобы я через месяц стал чемпионом джунов и уже работал по профессии!»\n\nВ какой-то момент понял, что пора собрать свои мысли (и не только мои) в один текст. Возможно, он поможет тем, кто только начинает.\n\nСразу обозначу: это не универсальная истина и не единственно верный путь, а практический взгляд на вход в IT-направление, основанный на реальных требованиях рынка и личных наблюдениях.\n\n## 1. Сначала — профессия, а не «Red Team»\n\nОдна из самых частых ошибок новичков — стремление «пойти в Red Team».\nВажно понимать: Red Team — это не профессия, а формат работы или роль внутри команды. То же самое и про «я хочу быть спецом в Blue Team».\n\nВ реальности существуют конкретные должности, которые могут работать в смежном направлении:\n\n- Application Security (AppSec)\n- DevSecOps\n- Security Engineer\n- Pentester / Offensive Security Engineer\n\nПричём эти роли могут вообще не называться / не быть в Red Team, но при этом включать смежные задачи.\n\n**Пример:**\n\nЕсли вам интересно не только проверять проекты на уязвимости, но и исправлять их, реализовывать автоматизацию защиты и проверку на уязвимости,\n\nто это скорее DevSecOps или AppSec, а не классический пентест.\n\nВажно честно ответить себе на вопрос:\nчто именно вы хотите делать каждый день на работе, а не как красиво звучит направление. Если определились с этим, идем дальше. \n\n## 2. Метод «просмотр 100 вакансий»\n\nПосле того как вы примерно определились с направлением, один из самых эффективных методов — анализ вакансий.\n\n**Алгоритм простой:**\n\n1. Открываете вакансии по выбранной роли (например, DevSecOps).\n2. Смотрите 50–100 вакансий.\n3. Выписываете повторяющиеся требования.\n\n\nОбращайте внимание в первую очередь на:\n\nJunior / Middle позиции и общие требования, которые встречаются в большинстве вакансий.\n\nСеньорские требования тоже полезно читать, но не стоит ориентироваться на них как на стартовую точку — без опыта туда не приходят.\n\nТак вы формируете реалистичный список того, что действительно нужно рынку, а не абстрактные «роадмапы из интернета».\n\n## 3. Что учить в первую очередь\n\nУниверсального ответа нет, но есть рабочий принцип:\n\n> Лучше учить не всё подряд, а то, где и зачем это используется.\n\nДаже если технология указана в требованиях, сначала стоит понять:\n\n1. В каком контексте она применяется. \n2. Какую задачу решает. \n3. Насколько глубоко её нужно знать именно для вашей роли.\n\nПосле этого уже можно расставлять личные приоритеты:\n\nчто учить глубоко? что — на уровне понимания? что отложить? \n\n## 4. Самообучение и практика решают\n\nЕсли у вас есть возможность:\n• нормальный ПК; \n• виртуалки; \n• время на эксперименты, \n\n— это огромный плюс.\n\nПо моим наблюдениям, студенты и начинающие специалисты, которые много экспериментируют самостоятельно, почти всегда:\n\nлучше понимают предмет, быстрее адаптируются и увереннее чувствуют себя на собеседованиях. Даже простой homelab с уязвимым веб-приложением или настройкой ELK/SIEM даёт больше, чем месяцы сухой теории.\n\n## 5. Опыт: как быть, если его «нет»\n\nЕсли вы студент колледжа или вуза и у вас была:\n\n- учебная практика; \n- производственная практика; \n- проект, связанный с безопасностью, \n\n— это можно и нужно указывать как опыт. Пусть даже если практика была слабая, но если вы научились и поняли работу, к примеру, каких-нибудь инструментов по анализу — это «+».\n\nНапример:\n\n> «Проведение аудита уязвимостей веб-сервиса в рамках учебной практики»\n\nКлючевой момент — вы должны реально это делать, а не просто «сдать отчёт».\n\nВажно не врать, а грамотно упаковывать свой реальный опыт:\n\n- практики; \n- pet-проекты; \n- лабораторные; \n- CTF и иные мероприятия; \n- собственные исследования.\n\nРынок ИБ это понимает — особенно на junior-уровне.\n\nПримечание: мдамс, возможно, в текущей ситуации с рынком многим не очень хочется брать джунов, и им сразу нужен спец-молодец, работающий за троих за зарплату одного или двоих людей. В таком случае вы, возможно, понимаете, что нужно делать. Как пример — искать адекватные вакансии. (К сожалению, сейчас мало, по моему мнению, таких, но всё же они существуют, просто нужно их в правильных местах искать). \n\n## 6. Личные кейсы и pet-проекты\n\nОтдельно хочу подчеркнуть важность личных кейсов.\n\nПопробуйте реализовать что-то, что может пригодиться в реальной работе или упростит жизнь вам самим.\n\nПример из текущих задач:\nя хочу сделать скрипт для упрощённого управления mTLS-сертификатами.\n\nЧто это даёт:\n\n1. Меньше ручной работы в терминале → экономия времени.\n2. Более простое и безопасное управление сертификатами.\n3. Быстрое разворачивание mutual TLS.\n\nАктуально ли это для компаний и стартапов?\nДа.\nИ именно такие вещи отлично смотрятся в портфолио.\n\nВозможно, скажут: «Да ваше портфолио и ваши проекты на фиг никому не нужны! Вот тебе тестовое, сиди и решай».\n\nТакие случаи бывают, и лично я (да и не только я) скипаю такие неадекватные вакансии, раз HR-ке после собеса всё равно на мои знания и то, что я показал в портфолио реально годные вещи, И ОНА ДАЁТ ТЕСТОВОЕ! :))) \n\nСкладывается ощущение, что таким образом дают, чтобы выполняли их работу бесплатно! \n\nИногда тестовые и стоит всё же пройти, если это требуется в данном «наборе». К примеру, если это набор на стажировку какую-нибудь, где у каждого вне зависимости от опыта выдаётся тестовое задание, и где они в большинстве случаев могут быть лёгкими для джунов с реальными знаниями, то тут стоит их решать. \n\n[ В общем, поняли, смотрим по ситуации. ]\n\n## 7. Участие в мероприятиях и CTF\n\nПрактику и актуальные знания дают:\n\n1. профильные мероприятия (например, CyberCamp);\n2. CTF и иные соревнования, особенно CTF task-based формата.\n\nCTF — это не только про «хакинг», но и про:\n\n- мышление; \n- поиск нестандартных решений; \n- работу с ограниченной информацией.\n\nДля старта не обязательно сразу идти в команды — многие форматы позволяют участвовать индивидуально.\n\n## 8. Знакомства и профессиональное окружение\n\nОбщение с людьми, которые уже работают в интересующем вас направлении, может дать: советы, разбор ошибок, обучение, а иногда — и приглашение на работу.\n\nЧаты, конференции, комьюнити — всё это реально работает. (Конечно, в некоторых случаях лучше из чата комьюнити переходить сразу в личку, так можно ускорить возможный темп знакомства). \n\n## 9. Частые вопросы\n\n- Нужны ли сертификаты, чтобы я смог быстро попасть на работу? \n\nВозможно, но в большинстве случаев — нет. Сертификаты (особенно рентабельные) дают лишь закрепление знаний и возможный «+» в резюме для вакансий, где требуют эти сертификаты. \n\n- Стоит ли проходить курсы и/или читать книги? \n\nНа ваше усмотрение. Здесь нужно решать вам, как эффективнее вы запоминаете. Если вы запоминаете и понимаете больше по книгам, то, возможно, стоит читать и книги с документацией. Но важно понимать, что курсы/книги не гарантируют вам, что вас примут на работу. Нужны знания и умения. К примеру, если вы знаете Docker (например, просмотр/запуск контейнеров), но никогда не делали, не читали, не заходили в логи посмотреть, почему контейнер не запустился, и сразу идёте гуглить / узнавать у ИИ, что случилось, — стоит подкрепить знания. \n\nЕсть люди, которые не читают доку и не проходили курсы, а просто скачивали и ставили себе тот же Docker и учились им управлять. :) \n\n## Вместо заключения\n\nВход в кибербезопасность, как и в другое IT-направление, — это не спринт и не линейный роадмап.\nЭто набор осознанных шагов:\n\n1. Понимание профессии. \n2. Анализ рынка. \n3. Практика. \n4. Собственные проекты. \n5. Общение с сообществом.\n\nИ чем раньше вы начнёте думать как инженер, а не как «новичок, ищущий волшебный курс», тем быстрее окажетесь в профессии.\n"
}